In [1]:
import pandas as pd
import numpy as np

Here we are going to use a combination of Pandas DataFrame functionality and a NumPy method to quickly create a 6x6 DataFrame populated with the numbers 0 - 35, with specified column heads. If you're looking to practice with DataFrames, the `np.arange().reshape()` methods are an easy way to create one quickly.

In [2]:
test_data = pd.DataFrame(np.arange(36).reshape(6,6),columns=('alpha','bravo','charlie','delta','echo','foxtrot'))

In [3]:
test_data

   alpha  bravo  charlie  delta  echo  foxtrot
0      0      1        2      3     4        5
1      6      7        8      9    10       11
2     12     13       14     15    16       17
3     18     19       20     21    22       23
4     24     25       26     27    28       29
5     30     31       32     33    34       35

Here we are defining a function with a single argument. In this case, it takes a single value `cellNum` and applies the inner workings of the function to it. We're also using an `else:` statement to determine an action when our initial `if:` proves to be false. _Remember your indentation!_

In [8]:
def num_mod(cellNum):
    if cellNum % 4 == 0:
        return cellNum, "is divisible by four"
    elif cellNum % 4 == 1:
        return cellNum, "one more than a multiple of four"
    elif cellNum % 4 == 2:
        return cellNum, "two more than a multiple of four"
    else:
        return cellNum, "one less than a multiple of four"

Remember `.apply()` with `pd.to_datetime` earlier? The `.applymap()` method is a way to _apply_ a function to elements individually. We can index out specific cells and then apply a function. It can even be one we defined ourselves.

In [9]:
test_data.iloc[0:2,0:3].applymap(num_mod)

,alpha,bravo,charlie
0,"(0, is divisible by four)","(1, one more than a multiple of four)","(2, two more than a multiple of four)"
1,"(6, two more than a multiple of four)","(7, one less than a multiple of four)","(8, is divisible by four)"

Where `.applymap()` can apply to individual cells, `.apply()` works with rows, columns, or the entire DataFrame. For this function, we are adding specifically named columns within the DataFrame. We are passing a row as an argument, and the function knows to work with certain columns and ignore the rest.

In [10]:
def row_add(row):
    return row.loc['bravo'] + row.loc['delta'] + row.loc['foxtrot']

In [19]:
def column_add(column):
    return column.iloc[0] + column.iloc[3] + column.iloc[5]

In [20]:
test_data

   alpha  bravo  charlie  delta  echo  foxtrot
0      0      1        2      3     4        5
1      6      7        8      9    10       11
2     12     13       14     15    16       17
3     18     19       20     21    22       23
4     24     25       26     27    28       29
5     30     31       32     33    34       35

In [16]:
test_data.apply(column_add,axis=0)

alpha      48
bravo      51
charlie    54
delta      57
echo       60
foxtrot    63
dtype: int64